/* An emdash surrounded by spaces for Open Recent menu items. */
" \\U2014 " = " — ";

/* An arrow surrounded by spaces for Open Recent menu items. */
" \\U25B6 " = " ▶ ";

/* User-presentable name of file created for autosaving. Arg is document name. */
"%@ (Autosaved)" = "%@ (automaattinen)";

/* Partial error string for when a document's type is not recognized. 1st argument is the name of the application. 2nd argument is the name of a file format. This whole string may become the argument of the 'no document could be created' string. */
"%@ cannot open files in the \\U201C%@\\U201D format." = "%1$@ ei voi avata tiedostoja, jotka ovat muodossa ”%2$@”.";

/* Partial error string for when a document's type is not recognized. The argument is the name of the application. This whole string may become the argument of the 'no document could be created' string. */
"%@ cannot open files of this type." = "%@ ei voi avata tämän tyyppisiä tiedostoja.";

/* Error string for when a document's type is not recognized. 2nd argument is the name of the application. 3rd argument is the name of a file format. */
"\\U201C%@\\U201D could not be handled because %@ cannot open files in the \\U201C%@\\U201D format." = "Kohdetta ”%1$@” ei voitu käsitellä, koska %2$@ ei voi avata tiedostoja, jotka ovat muodossa ”%3$@”.";

/* Error string for when a document's type is not recognized. 2nd argument is the name of the application. */
"\\U201C%@\\U201D could not be handled because %@ cannot open files of this type." = "Dokumenttia ”%1$@” ei voitu käsitellä, koska %2$@ ei voi avata tämän tyyppisiä tiedostoja.";

/* Label of Cancel button. */
"Cancel" = "Kumoa";

/* Action name for undoing print info changes. */
"Change Print Settings" = "Muuta tulostusasetuksia";

/* Title of alert panel which comes when the user tries to close a window containing an unsaved document. */
"Close" = "Sulje";

/* Label of change-discarding button shown at quit-time when there are unsaved documents. */
"Discard Changes" = "Hylkää muutokset";

/* Recovery suggestion for reason for when a document could not be saved because the file is locked. */
"Do you want to overwrite it anyway?" = "Haluatko silti korvata sen?";

/* Primary text of alert shown at document reversion time when the document has unsaved modifications. Arg is document name. */
"Do you want to revert to the most recently saved version of the document \\U201C%@\\U201D?" = "Haluatko palata dokumentin ”%@” viimeksi tallennettuun versioon?";

/* Primary text of alert shown at document-close-time when the document is unsaved. Arg is document name. */
"Do you want to save the changes you made in the document \\U201C%@\\U201D?" = "Haluatko tallentaa dokumenttiin ”%@” tehdyt muutokset?";

/* 1st recovery option for when a document could not be saved because the file is locked. */
"Don\\U2019t Overwrite" = "Älä korvaa";

/* Label of cancellation button shown when a document is found to have been overwritten. */
"Don\\U2019t Save" = "Älä tallenna";

/* Title of alerts which come up when an open recents item is missing or fails to open. */
"Error" = "Virhe";

/* Title of a save panel for a Save To operation. */
"Export" = "Vienti";

/* Name field label of a save panel for a Save To operation. */
"Export As:" = "Vie nimellä:";

/* Secondary text of alert shown at quit-time when there are unsaved documents. */
"If you don\\U2019t review your documents, all your changes will be lost." = "Jos et tarkasta dokumentteja, kaikki muutokset menetetään.";

/* Secondary text of alert shown when a document is found to have been moved. Arg is new parent directory name. */
"It will be saved to the \\U201C%@\\U201D folder, or you can specify another location." = "Tiedosto tallennetaan kansioon ”%@” tai voit määritellä toisen tallennuspaikan.";

/* Secondary text of alert shown when a document is found to have been renamed. */
"It will be saved under this new name, or you can provide another name." = "Tiedosto tallennetaan tällä uudella nimellä tai voidaan antaa uusi nimi.";

/* Error string for when a document could not be created. The argument is either a full sentence explaining why not or a blank string. */
"No document could be created. %@" = "Dokumenttia ei voitu luoda. %@";

/* 2nd recovery option for when a document could not be saved because the file is locked. */
"Overwrite" = "Korvaa";

/* For backwards compatibility only; doesn't appear anywhere in the UI anymore. */
"Quit" = "Lopeta";

/* Choice (on a button) given to user which allows him to quit the application even though he has not saved all of his documents first. */
"Quit Anyway" = "Lopeta kuitenkin";

/* Label of default button shown at document reversion time when the document has unsaved modifications. */
"Revert" = "Palauta";

/* Label of default button shown at quit-time when there are unsaved documents. */
"Review Changes\\U2026" = "Tarkista muutokset…";

/* Choice (on a button) given to user which allows him to review all his unsaved documents if he quits the application without saving them all first. */
"Review Unsaved" = "Näytä tallentamattomat";

/* Button choice which allows the user to save the document.
   Label of default button shown at document-close-time when the document is unsaved - no ellipses.
   Label of save-here button shown when a document is found to have been moved.
   Label of save-here button shown when a document is found to have been overwritten.
   Label of save-here button shown when a document is found to have been renamed.
   Title of a save panel for a Save or Save As operation. */
"Save" = "Tallenna";

/* Name field label of a save panel for a Save or Save As operation. */
"Save As:" = "Tallenna nimellä:";

/* Label of default button shown when a document can\\U2019t be found.
   Label of default button shown when a document is found in the trash.
   Label of save-somewhere-else button shown when a document is found to have been moved.
   Label of save-somewhere-else button shown when a document is found to have been renamed. */
"Save As\\U2026" = "Tallenna nimellä…";

/* Question asked of user when he/she tries to close a window containing an unsaved document. */
"Save changes to \\U201C%@\\U201D?" = "Tallennetaanko muutokset dokumenttiin ”%@”?";

/* Label of default button shown at document-close-time when the document is unsaved - with ellipses. */
"Save\\U2026" = "Tallenna…";

/* Error string for when an autosaved document could not be reopened. 2nd argument is either a full sentence explaining why not or a blank string. */
"The autosaved document \\U201C%@\\U201D could not be reopened. %@" = "Automaattisesti tallennettua dokumenttia ”%1$@” ei voitu avata. %2$@";

/* Secondary text of alert shown when a document is found to have been overwritten. */
"The changes made by the other application will be lost if you save. Save anyway?" = "Toisen ohjelman tekemät muutokset menetetään, jos tallennat. Haluatko varmasti tallentaa?";

/* Error string for when a document could not be autosaved. 2nd argument is either a full sentence explaining why not or a blank string. */
"The document \\U201C%@\\U201D could not be autosaved. %@" = "Dokumenttia ”%1$@” ei voitu tallentaa automaattisesti. %2$@";

/* Error string for when a document could not be saved. 2nd argument is the 'export as' file name. 3rd argument is either a full sentence explaining why not or a blank string. */
"The document \\U201C%@\\U201D could not be exported as \\U201C%@\\U201D. %@" = "Dokumenttia ”%1$@” ei voitu viedä nimellä ”%2$@”. %3$@";

/* Error string for when a document could not be opened for printing. 2nd argument is either a full sentence explaining why not or a blank string. */
"The document \\U201C%@\\U201D could not be opened for printing. %@" = "Dokumenttia ”%1$@” ei voitu avata tulostamista varten. %2$@";

/* Error string for when a document could not be opened. 2nd argument is either a full sentence explaining why not or a blank string. */
"The document \\U201C%@\\U201D could not be opened. %@" = "Dokumenttia ”%1$@” ei voitu avata. %2$@";

/* Error string for when a document could not be printed. 2nd argument is either a full sentence explaining why not or a blank string. */
"The document \\U201C%@\\U201D could not be printed. %@" = "Dokumenttia ”%1$@” ei voitu tulostaa. %2$@";

/* Error string for when a document could not be reverted. 2nd argument is either a full sentence explaining why not or a blank string. */
"The document \\U201C%@\\U201D could not be reverted. %@" = "Dokumenttia ”%1$@” ei voitu palauttaa. %2$@";

/* Error string for when a document could not be saved. 2nd argument is the 'save as' file name. 3rd argument is either a full sentence explaining why not or a blank string. */
"The document \\U201C%@\\U201D could not be saved as \\U201C%@\\U201D. %@" = "Dokumenttia ”%1$@” ei voitu tallentaa nimellä ”%2$@”. %3$@";

/* Error string for when a document could not be saved. 2nd argument is either a full sentence explaining why not or a blank string. */
"The document \\U201C%@\\U201D could not be saved. %@" = "Dokumenttia ”%1$@” ei voitu tallentaa. %2$@";

/* Primary text of alert shown when a document is found to have been moved. Arg is document name. */
"The document \\U201C%@\\U201D has been moved." = "Dokumentti ”%@” on siirretty.";

/* Primary text of alert shown when a document is found in the trash. Arg is document name. */
"The document \\U201C%@\\U201D is in the Trash." = "Dokumentti ”%@” on roskakorissa.";

/* Error description for when a document could not be saved because the file is locked. */
"The file \\U201C%@\\U201D is locked." = "Tiedosto ”%@” on lukittu.";

/* Error failure reason for when a document could not be saved because the file is locked. */
"The file is locked." = "Tiedosto on lukittu.";

/* Primary text of alert shown when a document can\\U2019t be found. Arg is document name. */
"The location of the document \\U201C%@\\U201D cannot be determined." = "Dokumentin ”%@” sijaintia ei voida määrittää.";

/* Message in alert given to user when he tries to open a recent document that fails to open. Argument is presentable document name. */
"The recent document \\U201C%@\\U201D could not be opened." = "Äskeistä dokumenttia ”%@” ei voitu avata.";

/* Message in alert given to user when he tries to open a recent document that is no longer there. Argument is presentable document name. */
"The recent document \\U201C%@\\U201D is missing." = "Äskeinen dokumentti ”%@” puuttuu.";

/* Error description for when a document could not be autosaved to a read-only directory. */
"This document could not be autosaved because you don\\U2019t have write access privileges to the folder that it\\U2019s in." = "Dokumenttia ei voitu tallentaa automaattisesti, koska sinulla ei ole kirjoitusoikeutta kansioon, jossa se on.";

/* Primary text of alert shown when a document is found to have been renamed. Arg is new document name. */
"This document has been renamed to \\U201C%@\\U201D." = "Dokumentti on nimetty uudelleen: ”%@”.";

/* Primary text of alert shown when a document is found to have been overwritten. Arg is document file name. */
"This document\\U2019s file has been changed by another application since you opened or saved it." = "Toinen ohjelma on muuttanut tiedostoa sen jälkeen kun avasit tai tallensit sen.";

/* User-presentable name of file created for autosaving. Arg is application name. */
"Unsaved %@ Document" = "Tallentamaton %@-dokumentti";

/* User-presentable name of file created for autosaving. First arg is application name. Second arg is number. */
"Unsaved %@ Document %ld" = "Ohjelman %1$@ tallentamaton dokumentti %2$ld";

/* Name to use for the first untitled document. */
"Untitled" = "Nimetön";

/* Name to use for untitled documents; the argument is replaced by a number. */
"Untitled %@" = "Nimetön %@";

/* Secondary text of alert shown when a document is found in the trash. */
"You can save to another location." = "Voit tallentaa toiseen paikkaan.";

/* Secondary text of alert shown when a document can\\U2019t be found. */
"You can specify where to save it." = "Tallennuspaikka voidaan määritellä.";

/* Primary text of alert shown at quit-time when there are unsaved documents. First arg is count of unsaved documents. Second arg is application name. */
"You have %1$@ %2$@ documents with unsaved changes. Do you want to review these changes before quitting?" = "Tallentamattomia %2$@-ohjelman dokumentteja on %1$@. Haluatko tarkistaa muutokset ennen lopettamista?";

/* Message given to user when he tries to quit the application without saving all of his documents. */
"You have unsaved documents." = "Kaikkia dokumentteja ei ole tallennettu.";

/* Recovery suggestion for reason for when a document could not be autosaved to a read-only directory. */
"Your changes will be lost if this computer malfunctions or loses power before you save them." = "Muutokset menetetään, jos tietokone vikaantuu tai virta katkeaa ennen muutosten tallentamista.";

/* Secondary text of alert shown at document-close-time when the document is unsaved. */
"Your changes will be lost if you don\\U2019t save them." = "Tallentamattomat muutokset menetetään.";

/* Secondary text of alert shown at document reversion time when the document has unsaved modifications. */
"Your current changes will be lost." = "Nykyiset muutokset menetetään.";

